In [1]:
import os

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('examples/ex1.csv')

In [4]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
!type examples\ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [7]:
pd.read_table('examples/ex1.csv', sep=',')

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [8]:
!type examples\ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [9]:
pd.read_csv('examples/ex2.csv',header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [10]:
pd.read_csv('examples/ex2.csv',names=['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [11]:
names = ['a','b','c','d','message']

In [12]:
pd.read_csv('examples/ex2.csv',names=names,index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [13]:
!type examples\csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [14]:
parsed = pd.read_csv('examples/csv_mindex.csv',index_col=['key1','key2'])

In [15]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [16]:
list(open('examples/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [17]:
result = pd.read_table('examples/ex3.txt',sep='\s+')

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

In [18]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [19]:
!type examples\ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [20]:
pd.read_csv('examples/ex4.csv',skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [21]:
!type examples\ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [22]:
result = pd.read_csv('examples/ex5.csv')

In [23]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [24]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [25]:
result = pd.read_csv('examples/ex5.csv',na_values=['NULL'])

In [26]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [27]:
sentinels = {'message':['foo','NA'],'something':['two']}

In [28]:
pd.read_csv('examples/ex5.csv',na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [29]:
pd.options.display.max_rows = 10

In [30]:
result = pd.read_csv('examples/ex6.csv')

In [31]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [32]:
pd.read_csv('examples/ex6.csv',nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [33]:
chunker = pd.read_csv('examples/ex6.csv',chunksize=1000)

In [34]:
chunker

In [35]:
tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(),fill_value=0)

In [36]:
tot = tot.sort_values(ascending= False)

In [37]:
tot

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
     ...
5    157.0
2    152.0
0    151.0
9    150.0
1    146.0
Length: 36, dtype: float64

In [38]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

In [39]:
data = pd.read_csv('examples/ex5.csv')

In [40]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [41]:
data.to_csv('examples/out.csv')

In [42]:
!type examples\out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [43]:
import sys

In [44]:
data.to_csv(sys.stdout,sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [45]:
data.to_csv(sys.stdout,na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [46]:
data.to_csv(sys.stdout, index=False,columns=['a','b','c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [47]:
date = pd.date_range('1/1/2000',periods=7)

In [49]:
dates = pd.date_range('1/1/2000',periods=7)

In [51]:
import numpy as np

In [52]:
ts = pd.Series(np.arange(7), index=dates)

In [53]:
ts.to_csv('examples/tseries.csv')

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: The signature of `Series.to_csv` was aligned to that of `DataFrame.to_csv`, and argument 'header' will change its default value from False to True: please pass an explicit value to suppress this warning.
  """Entry point for launching an IPython kernel.

In [54]:
!type examples\tsseries.csv

系统找不到指定的文件。

In [55]:
!type examples\tseries.csv

2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

In [56]:
!type examples\ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [57]:
import csv

In [58]:
f = open('examples\ex7.csv')

In [59]:
reader = csv.reader(f)

In [60]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [61]:
with open('examples/ex7.csv') as f:
    lines = list(csv.reader(f))

In [62]:
header, values=lines[0], lines[1:]

In [63]:
data_dict = {h: v for h, v in zip(header,zip(*values))}

In [64]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [65]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

In [67]:
with open('examples/ex7.csv') as f:
    reader = csv.reader(f, dialect = my_dialect)

In [72]:
with open('mydata.csv','w') as f:
    writer = csv.writer(f,dialect=my_dialect)
    writer.writerow(('one','two','three'))
    writer.writerow(('1','2','3'))
    writer.writerow(('4','5','6'))
    writer.writerow(('7','8','9'))

In [73]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [75]:
import json

In [76]:
result = json.loads(obj)

In [77]:
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [78]:
asjson = json.dumps(result)

In [83]:
siblings = pd.DataFrame(result['siblings'],columns=['name','age'])

In [84]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [86]:
!type examples\example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [87]:
data = pd.read_json('examples/example.json')

In [88]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [89]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [90]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

In [91]:
conda install lxml

Collecting package metadata: ...working... done
Solving environment: ...working... done

## Package Plan ##

  environment location: C:\Anaconda3

  added / updated specs:
    - lxml


The following packages will be downloaded:

    package                    |            build
    ---------------------------|-----------------
    conda-4.7.5                |           py37_0         3.0 MB
    conda-package-handling-1.3.10|           py37_0         280 KB
    ------------------------------------------------------------
                                           Total:         3.3 MB

The following NEW packages will be INSTALLED:

  conda-package-han~ pkgs/main/win-64::conda-package-handling-1.3.10-py37_0

The following packages will be UPDATED:

  conda                                       4.6.14-py37_0 --> 4.7.5-py37_0



Downloading and Extracting Packages

conda-package-handli | 280 KB    |            |   0%
conda-package-handli | 280 KB    | 4          |   4%
conda-package-handli | 280 KB    | 8          |   9%
conda-package-handli | 280 KB    | #7         |  17%
conda-package-handli | 280 KB    | ###        |  30%
conda-package-handli | 280 KB    | ###8       |  39%
conda-package-handli | 280 KB    | #####5     |  56%
conda-package-handli | 280 KB    | ######8    |  69%
conda-package-handli | 280 KB    | #######5   |  75%
conda-package-handli | 280 KB    | ########## | 100%

conda-4.7.5          | 3.0 MB    |            |   0%
conda-4.7.5          | 3.0 MB    |            |   0%
conda-4.7.5          | 3.0 MB    | 2          |   2%
conda-4.7.5          | 3.0 MB    | 3          |   3%
conda-4.7.5          | 3.0 MB    | 3          |   4%
conda-4.7.5          | 3.0 MB    | 4          |   4%
conda-4.7.5          | 3.0 MB    | 5          |   5%
conda-4.7.5          | 3.0 MB    | 6          |   6%
conda-4.7.5          | 3.0 MB    | 9          |   9%
conda-4.7.5          | 3.0 MB    | #          |  10%
conda-4.7.5          | 3.0 MB    | #          |  11%
conda-4.7.5          | 3.0 MB    | #1         |  12%
conda-4.7.5          | 3.0 MB    | #2         |  12%
conda-4.7.5          | 3.0 MB    | #4         |  15%
conda-4.7.5          | 3.0 MB    | #5         |  15%
conda-4.7.5          | 3.0 MB    | #6         |  16%
conda-4.7.5          | 3.0 MB    | #7         |  18%
conda-4.7.5          | 3.0 MB    | #9         |  19%
conda-4.7.5          | 3.0 MB    | ##         |  20%
conda-4.7.5          | 3.0 MB    | ##1        |  22%
conda-4.7.5          | 3.0 MB    | ##3        |  23%
conda-4.7.5          | 3.0 MB    | ##3        |  24%
conda-4.7.5          | 3.0 MB    | ##4        |  25%
conda-4.7.5          | 3.0 MB    | ##6        |  26%
conda-4.7.5          | 3.0 MB    | ##7        |  28%
conda-4.7.5          | 3.0 MB    | ##9        |  29%
conda-4.7.5          | 3.0 MB    | ###        |  30%
conda-4.7.5          | 3.0 MB    | ###1       |  31%
conda-4.7.5          | 3.0 MB    | ###2       |  32%
conda-4.7.5          | 3.0 MB    | ###3       |  34%
conda-4.7.5          | 3.0 MB    | ###5       |  35%
conda-4.7.5          | 3.0 MB    | ###6       |  36%
conda-4.7.5          | 3.0 MB    | ###7       |  37%
conda-4.7.5          | 3.0 MB    | ###8       |  38%
conda-4.7.5          | 3.0 MB    | ###9       |  40%
conda-4.7.5          | 3.0 MB    | ####       |  41%
conda-4.7.5          | 3.0 MB    | ####1      |  42%
conda-4.7.5          | 3.0 MB    | ####2      |  43%
conda-4.7.5          | 3.0 MB    | ####3      |  44%
conda-4.7.5          | 3.0 MB    | ####4      |  44%
conda-4.7.5          | 3.0 MB    | ####5      |  45%
conda-4.7.5          | 3.0 MB    | ####5      |  46%
conda-4.7.5          | 3.0 MB    | ####6      |  46%
conda-4.7.5          | 3.0 MB    | ####9      |  49%
conda-4.7.5          | 3.0 MB    | #####      |  50%
conda-4.7.5          | 3.0 MB    | #####1     |  51%
conda-4.7.5          | 3.0 MB    | #####2     |  52%
conda-4.7.5          | 3.0 MB    | #####2     |  53%
conda-4.7.5          | 3.0 MB    | #####3     |  54%
conda-4.7.5          | 3.0 MB    | #####4     |  54%
conda-4.7.5          | 3.0 MB    | #####5     |  56%
conda-4.7.5          | 3.0 MB    | #####6     |  56%
conda-4.7.5          | 3.0 MB    | #####7     |  58%
conda-4.7.5          | 3.0 MB    | #####8     |  59%
conda-4.7.5          | 3.0 MB    | #####9     |  59%
conda-4.7.5          | 3.0 MB    | ######     |  61%
conda-4.7.5          | 3.0 MB    | ######1    |  62%
conda-4.7.5          | 3.0 MB    | ######3    |  63%
conda-4.7.5          | 3.0 MB    | ######4    |  64%
conda-4.7.5          | 3.0 MB    | ######5    |  65%
conda-4.7.5          | 3.0 MB    | ######6    |  66%
conda-4.7.5          | 3.0 MB    | ######7    |  68%
conda-4.7.5          | 3.0 MB    | ######8    |  69%
conda-4.7.5          | 3.0 MB    | ######9    |  69%
conda-4.7.5          | 3.0 MB    | #######    |  70%
conda-4.7.5          | 3.0 MB    | #######2   |  72%
conda-4.7.5          | 3.0 MB    | #######2   |  73%
conda-4.7.5          | 3.0 MB    | #######3   |  74%
conda-4.7.5          | 3.0 MB    | #######4   |  74%
conda-4.7.5          | 3.0 MB    | ########4  |  85%
conda-4.7.5          | 3.0 MB    | #########  |  91%
conda-4.7.5          | 3.0 MB    | #########8 |  98%
conda-4.7.5          | 3.0 MB    | ########## | 100%
Preparing transaction: ...working... done
Verifying transaction: ...working... done
Executing transaction: ...working... done

Note: you may need to restart the kernel to use updated packages.

In [92]:
conda install beautifulsoup4 html5lib

Collecting package metadata (repodata.json): ...working... done
Solving environment: ...working... done

# All requested packages already installed.


Note: you may need to restart the kernel to use updated packages.

WARNING conda.base.context:use_only_tar_bz2(632): Conda is constrained to only using the old .tar.bz2 file format because you have conda-build installed, and it is <3.18.3.  Update or remove conda-build to get smaller downloads and faster extractions.

In [93]:
tables  pd.read_html('examples/fdic_failed_bank_list.html')

SyntaxError: invalid syntax (<ipython-input-93-965cd2d5609e>, line 1)

In [94]:
tables = pd.read_html('examples/fdic_failed_bank_list.html')

In [95]:
len(tables)

1

In [96]:
failures = tables[0]

In [97]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [98]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [99]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

In [100]:
from lxml import objectify

In [101]:
path = 'datasets/mta_perf/Performance_MNR.xml'

In [102]:
parsed = objectify.parse(open(path))

In [103]:
root = parsed.getroot()

In [105]:
data = []

In [106]:
skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ',
               'DESIRED_CHANGE', 'DECIMAL_PLACES']

for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [107]:
perf = pd.DataFrame(data)

In [108]:
perf.head()

,AGENCY_NAME,CATEGORY,DESCRIPTION,FREQUENCY,INDICATOR_NAME,INDICATOR_UNIT,MONTHLY_ACTUAL,MONTHLY_TARGET,PERIOD_MONTH,PERIOD_YEAR,YTD_ACTUAL,YTD_TARGET
0,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,96.9,95,1,2008,96.9,95
1,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,95,95,2,2008,96,95
2,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,96.9,95,3,2008,96.3,95
3,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,98.3,95,4,2008,96.8,95
4,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,95.8,95,5,2008,96.6,95

In [109]:
frame = pd.read_csv('examples/ex1.csv')

In [110]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [111]:
frame.to_pickle('examples/frame_pickel')

In [113]:
pd.read_pickle('examples/frame_pickel')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [114]:
frame = pd.DataFrame({'a':np.random.randn(100)})

In [115]:
frame

           a
0  -0.533731
1   0.899015
2   1.409317
3   0.243011
4   1.183540
..       ...
95  0.570724
96 -0.192883
97  0.469898
98  0.974350
99 -1.596135

[100 rows x 1 columns]

In [116]:
store = pd.HDFStore('mydata.h5')

In [117]:
store['obj1'] = frame

In [118]:
store['obj1_col'] = frame['a']

In [119]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [120]:
xlsx = pd.ExcelFile('examples/ex1.xlsx')

In [121]:
pd.read_excel(xlsx,'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [122]:
writer = pd.ExcelWriter('examples/ex2.xlsx')

In [123]:
frame.to_excel(writer,'Sheet1')

In [124]:
writer.save()

In [125]:
import requests

In [126]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [127]:
resp = requests.get(url)

In [128]:
resp

In [129]:
data = resp.json()

In [130]:
data[0]['title']

'Make pandas.to_parquet handles partition columns better'

In [131]:
issues = pd.DataFrame(data,columns=['number','title','labels','state'])

In [132]:
issues

,number,title,labels,state
0,27117,Make pandas.to_parquet handles partition colum...,[],open
1,27116,Bump python_requires to 3.5.2,"[{'id': 129350, 'node_id': 'MDU6TGFiZWwxMjkzNT...",open
2,27114,Decoupled more xlrd reading tests from openpyxl,"[{'id': 49254273, 'node_id': 'MDU6TGFiZWw0OTI1...",open
3,27111,TST: openpyxl tests fail if xlrd is not installed,"[{'id': 49254273, 'node_id': 'MDU6TGFiZWw0OTI1...",open
4,27110,BUG: Fix indexing on DatetimeBlock,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
...,...,...,...,...
25,27073,ENH: Json fill_value for missing fields,"[{'id': 49379259, 'node_id': 'MDU6TGFiZWw0OTM3...",open
26,27072,[POC] CLN: use ExtensionBlock for datetime tz ...,"[{'id': 849023693, 'node_id': 'MDU6TGFiZWw4NDk...",open
27,27070,Add semantic analyser,"[{'id': 1280988427, 'node_id': 'MDU6TGFiZWwxMj...",open
28,27069,Feature request: make read_parquet support rea...,[],open
29,27067,DOC: Exception raised if columns do not match ...,"[{'id': 1049312478, 'node_id': 'MDU6TGFiZWwxMD...",open

In [133]:
import sqlite3

In [134]:
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20), c REAL, d INTEGER
);"""

In [135]:
con = sqlite3.connect('mydata.sqlite')

In [136]:
con.execute(query)

In [137]:
con.commit()

In [138]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]

In [139]:
stmt = "INSERT INTO test VALUES(?,?,?,?)"

In [140]:
con.executemany(stmt, data)

In [141]:
cursor = con.execute('select * from test')

In [142]:
rows = cursor.fetchall()

In [143]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [146]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [147]:
pd.DataFrame(rows,columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [148]:
import sqlalchemy as sqla

In [149]:
db = sqla.create_engine('sqlite://mydata.sqlite')

ArgumentError: Invalid SQLite URL: sqlite://mydata.sqlite
Valid SQLite URL forms are:
 sqlite:///:memory: (or, sqlite://)
 sqlite:///relative/path/to/file.db
 sqlite:////absolute/path/to/file.db

In [150]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [151]:
pd.read_sql('select * from test',db)

Empty DataFrame
Columns: [a, b, c, d]
Index: []